{
  "base_model_name_or_path": "bigscience/bloomz-1b7",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 256,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Does the following tweets endorse the conspiracy theory that powerful actors like Bill Gates, Anthony Fauci, big pharma, the media, or the democratic party are suppressing evidence of hydroxychloroquine as a treatment for covid-19. Answer yes or no. \n\nTweet: Fauci and the #fakenewsmedia know hydroxychloroquine treats covid-19 but want to inject us with the bill gates vaccine \nAnswer: Yes\n\nTweet: ",
  "task_type": "CAUSAL_LM",
  "token_dim": 2048,
  "tokenizer_name_or_path": "bigscience/bloomz-1b7"
}