{
  "base_model_name_or_path": "bigscience/bloomz-1b7",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 256,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Do the following tweets spread  conspiracy theory that China created and spread the covid-19 virus? Common conspiracy hashtags include #chinaliedpeopledied and #chinavirus. Answer yes or no. \n\nTweet: China deliberately created and spread #wuhanvirus to cripple the us economy with fauci funding\nAnswer: Yes\n\nTweet: ",
  "task_type": "CAUSAL_LM",
  "token_dim": 2048,
  "tokenizer_name_or_path": "bigscience/bloomz-1b7"
}