{
  "base_model_name_or_path": "bigscience/bloomz-1b7",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 256,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Does the following tweets endorse the QAnon conspiracy theory that santanic globalist pedophiles and the deep state are conspiring against Donald Trump. Common conspiracy hashtags include #qanon, #thegreatawakening, and #wwg1wga Answer yes or no. \n\nTweet: #americafirst #maga #qarmy #qteam #wwg1wga #unitedwestand #patriots #patriotsunite #patriotsfight #digitalsoldiers #keyboardwarriors #qanon\nAnswer: Yes\n\nTweet: ",
  "task_type": "CAUSAL_LM",
  "token_dim": 2048,
  "tokenizer_name_or_path": "bigscience/bloomz-1b7"
}