{
  "base_model_name_or_path": "bigscience/bloomz-1b7",
  "inference_mode": true,
  "num_attention_heads": 16,
  "num_layers": 24,
  "num_transformer_submodules": 1,
  "num_virtual_tokens": 256,
  "peft_type": "PROMPT_TUNING",
  "prompt_tuning_init": "TEXT",
  "prompt_tuning_init_text": "Does the following tweets endorse the conspiracy theory concerning anthony fauci and the covid-19 pandemic. Common conspiracy hashtabs include #firefauci and #faucifraud. Answer yes or no. \n\nTweet: Fauci in collaboration with Bill Gates gave 3.7 million to china to create and spread covid-19 #firefauci\nAnswer: Yes\n\nTweet: ",
  "task_type": "CAUSAL_LM",
  "token_dim": 2048,
  "tokenizer_name_or_path": "bigscience/bloomz-1b7"
}